[
    {
        "model": "petpalapp.breed",
        "pk": 1,
        "fields": {
            "name": "Golden Retriever",
            "slug": "golden-retriever",
            "image": "breed/golden-retriever.jpg",
            "life_span": "10-12 years",
            "size": "Large",
            "weight": "55-75 lbs (25-34 kg)",
            "height": "20-24 inches (51-61 cm)",
            "exercise": "High",
            "grooming": "Moderate",
            "overview": "Golden Retrievers are friendly, intelligent, and devoted dogs. They are great family pets and excel in obedience training.",
            "good_with_kids": true,
            "energy_level": "High",
            "ease_of_training": "Very Easy",
            "grooming_requirement": "Moderate",
            "vocality": "Moderate",
            "affection_needs": "High",
            "exercise_requirement": "High",
            "origin_country": "Scotland",
            "breed_history": "Developed in the Scottish Highlands during the 1800s by Lord Tweedmouth, who crossbred the Yellow Retriever with the now-extinct Tweed Water Spaniel. The breed was officially recognized by the Kennel Club in 1911.",
            "original_purpose": "Hunting and retrieving waterfowl",
            "fun_fact_1": "Golden Retrievers have a strong instinct to carry things in their mouths and can carry eggs without breaking them!",
            "fun_fact_2": "They rank 4th in Stanley Coren's intelligence rankings, making them one of the smartest dog breeds.",
            "fun_fact_3": "Their water-repellent coat and webbed feet make them excellent swimmers.",
            "fun_fact_4": "The breed became one of America's most popular dogs since the 1970s.",
            "fun_fact_5": "Golden Retrievers are commonly used as service dogs, therapy dogs, and search-and-rescue dogs.",
            "fun_fact_6": "They were bred to work with hunters, so they have a natural eagerness to please their owners.",
            "diet_recommendations": "High-quality dry dog food formulated for large, active breeds. Feed 2-3 cups daily divided into two meals. Look for foods rich in protein (chicken, fish, lamb) and omega-3 fatty acids for coat health. Avoid overfeeding as they are prone to obesity.",
            "feeding_notes": "Prone to bloat - avoid exercise immediately after meals. Monitor weight carefully as they love to eat. Fresh water should always be available. Treats should not exceed 10% of daily calories.",
            "common_health_issues": "Hip dysplasia, elbow dysplasia, eye conditions (cataracts, progressive retinal atrophy), heart problems (subvalvular aortic stenosis), cancer (especially hemangiosarcoma and lymphoma), skin allergies, ear infections",
            "health_screening": "OFA hip and elbow evaluations, cardiac exam, ophthalmologist evaluation, genetic testing for PRA and ichthyosis. Annual wellness exams recommended.",
            "genetic_conditions": "Progressive Retinal Atrophy (PRA), Muscular Dystrophy, von Willebrand's Disease, Ichthyosis",
            "grooming_details": "Brush 2-3 times per week, daily during shedding season. Bathe every 6-8 weeks. Trim nails monthly. Clean ears weekly to prevent infections. Check and clean between paw pads regularly.",
            "coat_type": "Dense, water-repellent double coat",
            "shedding_level": "High",
            "exercise_details": "Requires 60-90 minutes of daily exercise. Activities should include walks, runs, swimming, fetch, and playtime. Excellent jogging or hiking companions. Needs both physical and mental exercise.",
            "mental_stimulation": "Puzzle toys, obedience training, retrieving games, scent work, agility courses. They excel at learning new commands and tricks.",
            "training_tips": "Highly trainable and eager to please. Use positive reinforcement methods. Start socialization and basic training early. They respond well to consistency and patience. Avoid harsh corrections as they are sensitive.",
            "socialization_needs": "Early and ongoing socialization with people, dogs, and various environments. Naturally friendly but need exposure to prevent shyness. Puppy classes highly recommended.",
            "temperament_description": "Friendly, reliable, trustworthy, kind, confident, and not aggressive. They are gentle, patient, and eager to please. Known for their stable temperament and love of people.",
            "behavior_traits": "Mouthy behavior (loves to carry things), high food motivation, water-loving, gentle with children, social with other dogs, minimal guarding instinct, may jump on people when excited",
            "ideal_home": "House with a fenced yard preferred. Can adapt to apartment living if given adequate exercise. Best with active families who can provide attention and activity.",
            "climate_tolerance": "Tolerates cold weather well, moderate tolerance for heat (needs shade and water in summer)",
            "good_with_other_dogs": true,
            "good_with_cats": true,
            "good_with_strangers": true,
            "special_considerations": "Prone to separation anxiety - should not be left alone for long periods. Needs family interaction. Sheds heavily twice a year. May develop destructive behaviors if under-exercised or bored.",
            "first_time_owner_friendly": true
        }
    },
    {
        "model": "petpalapp.breed",
        "pk": 2,
        "fields": {
            "name": "German Shepherd",
            "slug": "german-shepherd",
            "image": "breed/german-shepherd.jpg",
            "life_span": "9-13 years",
            "size": "Large",
            "weight": "50-90 lbs (22-40 kg)",
            "height": "22-26 inches (56-66 cm)",
            "exercise": "High",
            "grooming": "Moderate",
            "overview": "German Shepherds are confident, courageous, and intelligent working dogs. They are loyal protectors and versatile companions.",
            "good_with_kids": true,
            "energy_level": "High",
            "ease_of_training": "Very Easy",
            "grooming_requirement": "Moderate",
            "vocality": "Moderate to High",
            "affection_needs": "Moderate",
            "exercise_requirement": "High",
            "origin_country": "Germany",
            "breed_history": "Developed in Germany in the late 1800s by Captain Max von Stephanitz, who aimed to create the perfect herding dog. Standardized in 1899, they quickly became valued for police and military work worldwide.",
            "original_purpose": "Herding sheep and protecting flocks",
            "fun_fact_1": "German Shepherds were the first guide dogs for the blind, establishing the concept of service dogs.",
            "fun_fact_2": "They rank 3rd in intelligence among all dog breeds, excelling at learning complex commands.",
            "fun_fact_3": "Famous German Shepherds include Rin Tin Tin and Strongheart, both Hollywood stars in the 1920s.",
            "fun_fact_4": "They are the second most popular breed in the United States.",
            "fun_fact_5": "Their nose has approximately 225 million scent receptors, making them excellent detection dogs.",
            "fun_fact_6": "German Shepherds can be trained to perform over 50 different tasks for police, military, and service work.",
            "diet_recommendations": "High-quality large breed formula with glucosamine for joint health. Feed 3-4 cups daily divided into 2 meals. Protein content should be 18-22%. Include omega fatty acids for coat and skin health.",
            "feeding_notes": "Risk of bloat (gastric dilatation-volvulus) - feed smaller meals and avoid exercise after eating. Some individuals have sensitive stomachs. Maintain lean body condition to reduce stress on joints.",
            "common_health_issues": "Hip and elbow dysplasia, degenerative myelopathy, bloat, exocrine pancreatic insufficiency, perianal fistulas, allergies, hemangiosarcoma",
            "health_screening": "OFA hip and elbow certification, cardiac exam, DM genetic testing, annual vet checkups, joint assessments for older dogs",
            "genetic_conditions": "Degenerative Myelopathy (DM), Hip Dysplasia, Elbow Dysplasia, Von Willebrand's Disease",
            "grooming_details": "Brush 3-4 times weekly, daily during shedding seasons. Bathe every 8-12 weeks. Trim nails every 3-4 weeks. Check and clean ears weekly. Dental care important.",
            "coat_type": "Medium-length double coat",
            "shedding_level": "High",
            "exercise_details": "Needs 60-120 minutes of daily vigorous exercise. Include walks, runs, training sessions, and play. Excellent for agility, tracking, and protection sports. Mental stimulation equally important.",
            "mental_stimulation": "Advanced obedience, protection training, nose work, puzzle toys, job or purpose (even if simple tasks). They need to work and use their minds.",
            "training_tips": "Extremely trainable but requires confident, consistent leadership. Start early with socialization and obedience. Use firm but fair positive reinforcement. They excel in structured training environments.",
            "socialization_needs": "Critical early socialization to prevent overprotectiveness. Expose to various people, animals, sounds, and situations. Their natural guarding instinct needs proper channeling.",
            "temperament_description": "Confident, courageous, intelligent, loyal, and protective. Can be aloof with strangers but not aggressive without cause. Strong work ethic and desire to serve their family.",
            "behavior_traits": "Natural guarding instinct, may be territorial, forms strong bonds with family, can be vocal, high prey drive, needs a job or purpose, may herd children or other pets",
            "ideal_home": "House with secure yard required. Not suitable for apartments unless extensively exercised. Best with experienced owners who understand working breeds and can provide structure.",
            "climate_tolerance": "Excellent cold tolerance, moderate heat tolerance (requires shade and water)",
            "good_with_other_dogs": true,
            "good_with_cats": false,
            "good_with_strangers": false,
            "special_considerations": "Needs experienced owner who can establish leadership. Can develop behavioral issues if under-stimulated. Strong prey drive may pose challenges with small pets. Regular veterinary care important for joint health.",
            "first_time_owner_friendly": false
        }
    },
    {
        "model": "petpalapp.breed",
        "pk": 3,
        "fields": {
            "name": "Labrador Retriever",
            "slug": "labrador-retriever",
            "image": "breed/labrador.jpg",
            "life_span": "10-12 years",
            "size": "Large",
            "weight": "55-80 lbs (25-36 kg)",
            "height": "21-24 inches (53-61 cm)",
            "exercise": "High",
            "grooming": "Low to Moderate",
            "overview": "Labrador Retrievers are friendly, outgoing, and active dogs. They are America's most popular breed and make excellent family companions.",
            "good_with_kids": true,
            "energy_level": "High",
            "ease_of_training": "Very Easy",
            "grooming_requirement": "Low",
            "vocality": "Low to Moderate",
            "affection_needs": "High",
            "exercise_requirement": "High",
            "origin_country": "Canada (Newfoundland)",
            "breed_history": "Originated in Newfoundland, Canada in the 1500s, where they helped fishermen haul nets and catch fish. Brought to England in the 1800s and refined into the breed we know today. Recognized by AKC in 1917.",
            "original_purpose": "Retrieving fishing nets and fish for fishermen",
            "fun_fact_1": "Labradors have been America's #1 most popular dog breed for over 30 consecutive years!",
            "fun_fact_2": "They have a water-resistant coat and an 'otter tail' that acts like a rudder when swimming.",
            "fun_fact_3": "Labs come in three colors: yellow, black, and chocolate - all can appear in the same litter!",
            "fun_fact_4": "Their soft mouth allows them to retrieve game without damaging it.",
            "fun_fact_5": "Labs are the most popular choice for guide dogs, search-and-rescue, and therapy work.",
            "fun_fact_6": "They were originally called St. John's Dogs or Lesser Newfoundland Dogs.",
            "diet_recommendations": "High-quality large breed food, 2.5-3 cups daily in 2 meals. Protein 20-25%, moderate fat. Include joint supplements as they age. Monitor calories carefully - Labs love food!",
            "feeding_notes": "Extremely food-motivated and prone to obesity. Use measuring cups and avoid table scraps. Feed at scheduled times. Slow-feeder bowls can help prevent gulping. Risk of bloat - no exercise after meals.",
            "common_health_issues": "Hip and elbow dysplasia, obesity, ear infections, exercise-induced collapse, progressive retinal atrophy, heart disease",
            "health_screening": "OFA hip and elbow evaluations, eye exam, EIC genetic test, cardiac screening, annual wellness exams",
            "genetic_conditions": "Progressive Retinal Atrophy (PRA), Exercise-Induced Collapse (EIC), Centronuclear Myopathy",
            "grooming_details": "Brush weekly, daily during seasonal shedding. Bathe every 6-8 weeks. Trim nails monthly. Clean ears weekly (prone to infections). Check between toes regularly.",
            "coat_type": "Short, dense, water-resistant double coat",
            "shedding_level": "Moderate to High",
            "exercise_details": "Requires 60-90 minutes daily exercise. Love swimming, fetch, hiking, and running. High-energy dogs that need both physical and mental activity. Puppies need controlled exercise to protect developing joints.",
            "mental_stimulation": "Retrieving games, obedience training, scent work, puzzle feeders, swimming activities. Need variety to prevent boredom.",
            "training_tips": "Highly trainable with positive reinforcement. Food motivation makes training easy. Start early - they remain puppy-like for 2-3 years. Consistency important. Can be exuberant and needs impulse control training.",
            "socialization_needs": "Generally friendly but early socialization important. Expose to people, dogs, and environments. Puppy classes recommended. Their friendliness should be channeled appropriately.",
            "temperament_description": "Friendly, outgoing, and active with even temperament. Gentle, intelligent, and eager to please. Not typically aggressive or territorial. Love everyone - poor guard dogs!",
            "behavior_traits": "Food obsessed, mouthy when young, love water, may jump on people, chew when bored, slow to mature, retrieve instinct, social with dogs and people",
            "ideal_home": "House with yard preferred but adaptable. Need active families. Great with children. Can adapt to various living situations if exercised adequately.",
            "climate_tolerance": "Good cold tolerance, moderate heat tolerance",
            "good_with_other_dogs": true,
            "good_with_cats": true,
            "good_with_strangers": true,
            "special_considerations": "Prone to obesity - strict diet management essential. May develop separation anxiety. Can be destructive if bored or under-exercised. Needs regular ear cleaning to prevent infections.",
            "first_time_owner_friendly": true
        }
    }
]